[
    {
      "id": "RE001",
      "estate_title": "Single Family Home",
      "image": "https://i.ibb.co/drLhwWN/back-view-family-hugging-admiring-their-home.jpg",
      "segment_name": "Residential",
      "description": "This beautiful modern family home is located in the serene suburbs of the city. Boasting a spacious 2000 sq ft area, it features a contemporary design with an open floor plan, large windows for natural light, and high-end finishes throughout. The living room is perfect for entertaining, while the gourmet kitchen with state-of-the-art appliances will delight any home chef. The property includes a luxurious master suite with a walk-in closet and en-suite bathroom, two additional bedrooms, and a versatile office space. Outside, the landscaped garden and swimming pool provide an oasis for relaxation and recreation. With excellent schools, parks, and shopping centers nearby, this home is ideal for families looking for a blend of comfort and convenience.",
      "price": "4500000 TK",
      "status": "sale",
      "area": "2000 sq ft",
      "location": "123 Elm Street, Springfield",
      "facilities": ["Living room", "Swimming pool", "Kitchen"]
    },
    {
      "id": "RE002",
      "estate_title": "Townhouses",
      "image": "https://i.ibb.co/SV8R6MJ/facade-residential-building.jpg",
      "segment_name": "Residential",
      "description": "Experience urban living at its finest in this luxury downtown apartment. Situated in the heart of the city, this 1500 sq ft residence offers breathtaking city views and convenient access to restaurants, theaters, and shopping. The apartment features an open-concept living area with floor-to-ceiling windows, hardwood floors, and modern lighting fixtures. The sleek kitchen is equipped with stainless steel appliances, quartz countertops, and custom cabinetry. The master bedroom includes a spacious closet and a stylish en-suite bathroom with a walk-in shower. Additional amenities include a fitness center, rooftop terrace, and 24-hour concierge service. Perfect for young professionals or couples seeking a vibrant city lifestyle.",
      "price": "3500 TK",
      "status": "rent",
      "area": "1500 sq ft",
      "location": "456 Main Street, Metropolis",
      "facilities": ["Living room", "Kitchen", "Fitness center"]
    },
    {
      "id": "RE003",
      "estate_title": "Apartments",
      "image": "https://i.ibb.co/hRPyLtk/3d-rendering-beautiful-luxury-bedroom-suite-hotel-with-tv-shelf.jpg",
      "segment_name": "Residential",
      "description": "Nestled in the countryside, this charming cottage offers a peaceful retreat from the hustle and bustle of city life. Spanning 1800 sq ft, the home features a cozy living room with a wood-burning fireplace, a fully-equipped kitchen with rustic charm, and a spacious dining area. The property includes three bedrooms, each with ample closet space, and two updated bathrooms. The large backyard is perfect for gardening, outdoor dining, or simply enjoying the tranquility of nature. With its picturesque setting and close-knit community, this cottage is ideal for those seeking a serene and idyllic lifestyle. Local amenities include farmers' markets, hiking trails, and quaint shops.",
      "price": "30000000 TK",
      "status": "sale",
      "area": "1800 sq ft",
      "location": "789 Country Lane, Greenfield",
      "facilities": ["Living room", "Kitchen", "Dining area", "Fireplace", "Swimming pool", "Fitness center"]
    },
    {
      "id": "RE004",
      "estate_title": "Student Housing",
      "image": "https://i.ibb.co/m0TZgbY/portrait-smiley-woman-library-1.jpg",
      "segment_name": "Residential",
      "description": "This stunning beachfront villa offers unparalleled views of the ocean and direct access to the beach. Covering 2500 sq ft, the villa features a spacious living room with panoramic windows, a gourmet kitchen with high-end appliances, and an elegant dining area. The master suite includes a private balcony, a walk-in closet, and a luxurious en-suite bathroom with a soaking tub. Two additional bedrooms and bathrooms provide ample space for family and guests. Outdoor amenities include a swimming pool, a patio with a BBQ area, and beautifully landscaped gardens. This property is perfect for those looking to enjoy the ultimate beachfront lifestyle, with opportunities for swimming, sunbathing, and water sports right at their doorstep.",
      "price": "2200 TK",
      "status": "rent",
      "area": "500 sq ft",
      "location": "123 Ocean Drive, Seaside",
      "facilities": ["Living room", "Kitchen"]
    },
    {
      "id": "RE005",
      "estate_title": "Senior Living communities",
      "image": "https://i.ibb.co/GdkRYjd/medium-shot-people-celebrating-eid-al-fitr-1.jpg",
      "segment_name": "Residential",
      "description": "Located in a family-friendly neighborhood, this suburban townhouse offers a perfect blend of comfort and convenience. The 1600 sq ft property features a bright living room with large windows, a modern kitchen with granite countertops and stainless steel appliances, and a dining area that opens onto a private patio. The master bedroom includes an en-suite bathroom and a walk-in closet, while two additional bedrooms provide ample space for a growing family. The home also features a finished basement that can be used as a recreation room or home office. Residents will appreciate the proximity to parks, schools, and shopping centers, making it an ideal choice for families seeking a suburban lifestyle.",
      "price": "3500000 TK",
      "status": "sale",
      "area": "1600 sq ft",
      "location": "456 Maple Avenue, Pleasantville",
      "facilities": ["Living room", "Kitchen", "Dining area"]
    },
    {
      "id": "RE006",
      "estate_title": "Modern Studio Apartment",
      "image": "https://i.ibb.co/qrtZtsS/bedroom-with-large-window-bed-with-white-bed-plant-it.jpg",
      "segment_name": "Residential",
      "description": "This modern studio apartment is perfect for individuals seeking a stylish and convenient urban living space. At 600 sq ft, the apartment features an open-plan living area with sleek finishes, a fully-equipped kitchen with contemporary appliances, and a cozy sleeping nook. The bathroom is modern and includes a walk-in shower. The apartment building offers a range of amenities including a fitness center, a rooftop lounge, and secure parking. Located in the city center, residents have easy access to public transportation, dining, shopping, and entertainment options. Ideal for young professionals or students looking for a comfortable and low-maintenance home in the heart of the city.",
      "price": "1800 TK",
      "status": "rent",
      "area": "600 sq ft",
      "location": "789 City Street, Downtown",
      "facilities": ["Living room", "Kitchen", "Parking"]
    }
  ]
  